---THAIC Added
--======================================
--THlib music
--======================================

--家乡的小曲
MusicRecord("spellcard", 'THlib/music/spellcard.ogg', 75, 0xc36e80 / 44100 / 4)

--神妈的小曲
DeathMusic = 'aic_bgm20'

--正式版曲目
--一定记得查采样率！不是每首都是44100的！
lstg.bgm_loop = {
    [0] = { 87.8, 79.26 },--LuaSTG原版标题曲
    {  7090800 / 44100,  3351600 / 44100 },--标题曲
    {  5627141 / 44100,  5152698 / 44100 },--零面道中
    {  9550008 / 44100,  5754492 / 44100 },--本田 珠辉，3795516 ~ 9550008
    {  5669866 / 44100,  4429092 / 44100 },--本田 珠辉LSC，1240774 ~ 5669866
    {  5303071 / 44100,  4680511 / 44100 },--SNS部四人，622560 ~ 5303071
    {  6029406 / 44100,  3948016 / 44100 },--一面道中，2081390 ~ 6029406
    {  7314610 / 44100,  3675823 / 44100 },--爱丽丝，3638787 ~ 7314610
    {  7603236 / 44100,  3804944 / 44100 },--爱丽丝LSC，3798292 ~ 7603236
    { 10519726 / 48000, 10519726 / 48000 },--EX面道中
    {  9665425 / 48000,  8230116 / 48000 },--诺艾尔一阶段
    {  1935539 / 44100,  1935539 / 44100 },--伊夏，0 ~ 1935539
    {  4748315 / 48000,  4188471 / 48000 },--普莉姆拉
    {  9887876 / 48000,  8815812 / 48000 },--诺艾尔二阶段，1072064 ~ 9887876
    {  2307595 / 48000,  1072541 / 48000 },--圣光爆发
    {  8521462 / 48000,  7236214 / 48000 },--诺艾尔最终阶段，1285248 ~ 8521462
    {  7740086 / 48000,  7740086 / 48000 },--诺艾尔LSC曲删减版, 0 ~ 7740086
    {  2666887 / 48000,  2666887 / 48000 },--结局A对话
    {        146.94527,        122.03389 },--结局B对话，24.91138s ~ 146.94527s
    {  3648512 / 44100,  3648512 / 44100 },--staff曲
    {           34.834,            27.54 },--疮痍曲
    --以下为DLC曲目
    {  9435446 / 44100,  8877280 / 44100 },--七面道中，558166 ~ 9435446
    { 10586563 / 44100, 10220754 / 44100 },--舞&里乃，365809 ~ 10586563
    { 24850724 / 44100, 13929860 / 44100 },--摩多罗豪华版，10920864 ~ 24850724
    { 10766429 / 44100,  5063850 / 44100 },--八面道中5702579 ~ 10766429
    {  8460706 / 44100,  5119318 / 44100 },--紫一阶段
    { 16543380 / 44100, 10282404 / 44100 },--紫二阶段，6260976 ~ 16543380
    {  8752268 / 44100,  3734780 / 44100 },--紫三阶段，5017488 ~ 8752268
    {  6922836 / 44100,  5869848 / 44100 },--紫LSC，1052988 ~ 922836
    { 10051623 / 44100,  5538531 / 44100 },--PH结局曲，4213092 ~ 10051623
    {  7144062 / 44100,  4190282 / 44100 },--标题曲（新），2953780 ~ 7144062
    --特殊曲目
    ['16_full'] = { 10766844 / 48000, 10295910 / 48000 },--诺艾尔LSC曲完整版, 470934 ~ 10766844
}   
--]]

lstg.bgm_volume = {}

--[[
曲目名单： 
1.梦境彼方 摇篮仙境
2.Wonderland of 0 & 1
3.Star Chaser
4.Star Rider
5./*死鱼眼_日照不足_往返跑部*/
6.正午时分的妖精宴会
7.G.H.O.S.T
8.缥缈之风　～ Assassinatroid
9.魔法使的祭典　～ Starry Forest
10.森林中的未知际遇
11.纯白之花
12.守护之光
13.超越空想的Stella
14.即使已然无力回天
15.于乐园中仰望繁星　～ Alice In Gensokyo
16.失色的星之梦　～ Reality or Fantasy?
17.森之意志
18.宁静的夏夜
19.Above Star
20.梦醒之时
◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈
--以下是DLC曲目
◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈◈
21.DOORS_OF_MYSTERIES
22.BACK_DANCERS
23.INDESCRIBABLE
24.DEEP_INTO_WONDERLAND
25.ALTERNATIVE
26.THE_YAKUMO
27.EYE_OF_LAPLACE
28.LAST_DANCE
29.VIOLET_NIGHT
30.乐园与群星与永远之梦
--]]

local loop = lstg.bgm_loop
for i = 0, 30 do
    if aic.DLC or i <= 20 or _debug._debug then
        MusicRecord("aic_bgm" .. i, "THlib/music/Muki_AiC_bgm" .. i .. ".ogg", loop[i][1], loop[i][2])
    end
end
MusicRecord("aic_bgm16_full", "THlib/music/Muki_AiC_bgm16_full.ogg", loop['16_full'][1], loop['16_full'][2])


